---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsElecLoadsummaryDemandCurrentParam
source: html/d84f2986-1784-e612-decb-248e0974a79d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsElecLoadsummaryDemandCurrentParam Property

"Estimated Demand Current"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsElecLoadsummaryDemandCurrentParam { get; }
```